# HostObjectSubcomponentInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HostObjectSubcomponentInfo Methods
HostObjectSubcomponentInfo Class See Also
---
The HostObjectSubcomponentInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCurveLoop | Gets the CurveLoop representing the base profile curve loop of the roof or floor slab |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetPlane | Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace